print("加：", 1 + 1)  # 输出 加：2
print("减：", 10 - 1)  # 输出 减：9
print("乘：", 2 * 5)  # 输出 乘：10
print("除：", 5 / 4)  # 输出 除：1.25
print("整数除：", 5 // 4)  # 输出 整数除：1
print("取余：", 5 % 4)  # 输出 取余：1
print("指数：", 2 ** 3)  # 输出 指数：8


# +=	加法赋值运算符	c += a 等效于 c = c + a
# -=	减法赋值运算符	c -= a 等效于 c = c - a
# *=	乘法赋值运算符	c *= a 等效于 c = c * a
# /=	除法赋值运算符	c /= a 等效于 c = c / a
# %=	取模赋值运算符	c %= a 等效于 c = c % a
# **=	幂赋值运算符	c **= a 等效于 c = c ** a
# //=	取整除赋值运算符	c //= a 等效于 c = c // a

num = 2
num += 1
print(num)
num *= 5
print(num)
